#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_eip.nat_1: Refreshing state... [id=eipalloc-00414a50017e479a8]
aws_eip.nat_2: Refreshing state... [id=eipalloc-063d1241389fbdbfa]
aws_efs_file_system.shared_storage: Refreshing state... [id=fs-0f478b3d4b9a02ce4]
aws_vpc.main: Refreshing state... [id=vpc-07875707521c30620]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:cluster/main]
aws_subnet.public_1: Refreshing state... [id=subnet-07342c785f65a9e00]
aws_subnet.reverse_proxy_1: Refreshing state... [id=subnet-0716901fe27fd7512]
aws_security_group.efs_sg: Refreshing state... [id=sg-0175af82259da2737]
aws_subnet.public_2: Refreshing state... [id=subnet-0d46008d631cc18e5]
aws_security_group.aurora_sg: Refreshing state... [id=sg-02f015e760b3cb2c6]
aws_security_group.alb_sg: Refreshing state... [id=sg-0f6c5ed3112b55269]
aws_subnet.reverse_proxy_2: Refreshing state... [id=subnet-02dce6fccf468d75f]
aws_subnet.wordpress_1: Refreshing state... [id=subnet-039350281fbe8abf9]
aws_lb_target_group.reverse_proxy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/036f5fdc96c8cdd0]
aws_subnet.wordpress_2: Refreshing state... [id=subnet-0ed370ee4266b80e7]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-00e60b1f874d18eda]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-053d8e2853385ce7d]
aws_security_group.reverse_proxy_sg: Refreshing state... [id=sg-07d2c378d1e603dae]
aws_db_subnet_group.wordpress: Refreshing state... [id=wordpress]
aws_efs_mount_target.wordpress_2: Refreshing state... [id=fsmt-0574625fa41402f78]
aws_efs_mount_target.reverse_proxy_1: Refreshing state... [id=fsmt-074e81398d50c6a7c]
aws_security_group.wordpress_sg: Refreshing state... [id=sg-05d8ae170ab9a456f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.reverse_proxy_scale_down will be created
  + resource "aws_appautoscaling_policy" "reverse_proxy_scale_down" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "reverse-proxy-scale-down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.reverse_proxy_scale_up will be created
  + resource "aws_appautoscaling_policy" "reverse_proxy_scale_up" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "reverse-proxy-scale-up"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 50

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.wordpress_scale_down will be created
  + resource "aws_appautoscaling_policy" "wordpress_scale_down" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress-scale-down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_appautoscaling_policy.wordpress_scale_up will be created
  + resource "aws_appautoscaling_policy" "wordpress_scale_up" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "wordpress-scale-up"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.reverse_proxy_scaling_target will be created
  + resource "aws_appautoscaling_target" "reverse_proxy_scaling_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # aws_appautoscaling_target.wordpress_scaling_target will be created
  + resource "aws_appautoscaling_target" "wordpress_scaling_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # aws_ecs_service.reverse_proxy_service will be created
  + resource "aws_ecs_service" "reverse_proxy_service" {
      + cluster                            = "arn:aws:ecs:us-east-1:816069151329:cluster/main"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "reverse-proxy-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "reverse-proxy"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/036f5fdc96c8cdd0"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-07d2c378d1e603dae",
            ]
          + subnets          = [
              + "subnet-02dce6fccf468d75f",
              + "subnet-0716901fe27fd7512",
            ]
        }
    }

  # aws_ecs_service.wordpress_service will be created
  + resource "aws_ecs_service" "wordpress_service" {
      + cluster                            = "arn:aws:ecs:us-east-1:816069151329:cluster/main"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "wordpress-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-05d8ae170ab9a456f",
            ]
          + subnets          = [
              + "subnet-039350281fbe8abf9",
              + "subnet-0ed370ee4266b80e7",
            ]
        }

      + service_connect_configuration {
          + enabled = true

          + service {
              + discovery_name = "wordpress"
              + port_name      = "php-fpm"
            }
        }
    }

  # aws_ecs_task_definition.reverse_proxy will be created
  + resource "aws_ecs_task_definition" "reverse_proxy" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "ravenoak/wp-nginx-fcgi:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/reverse-proxy"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "reverse-proxy"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/var/www/html"
                          + sourceVolume  = "shared-storage"
                        },
                    ]
                  + name             = "reverse-proxy"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + name          = "http"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + family                   = "reverse-proxy"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "shared-storage"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0f478b3d4b9a02ce4"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

  # aws_ecs_task_definition.wordpress_task will be created
  + resource "aws_ecs_task_definition" "wordpress_task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + family                   = "wordpress"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "shared-storage"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0f478b3d4b9a02ce4"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

  # aws_efs_mount_target.reverse_proxy_2 will be created
  + resource "aws_efs_mount_target" "reverse_proxy_2" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-0f478b3d4b9a02ce4"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0175af82259da2737",
        ]
      + subnet_id              = "subnet-02dce6fccf468d75f"
    }

  # aws_efs_mount_target.wordpress_1 will be created
  + resource "aws_efs_mount_target" "wordpress_1" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-0f478b3d4b9a02ce4"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0175af82259da2737",
        ]
      + subnet_id              = "subnet-039350281fbe8abf9"
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = "vpc-07875707521c30620"
    }

  # aws_lb.reverse_proxy_alb will be created
  + resource "aws_lb" "reverse_proxy_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "reverse-proxy-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0f6c5ed3112b55269",
        ]
      + subnets                                                      = [
          + "subnet-02dce6fccf468d75f",
          + "subnet-0716901fe27fd7512",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.reverse_proxy_listener will be created
  + resource "aws_lb_listener" "reverse_proxy_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/036f5fdc96c8cdd0"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_nat_gateway.nat_1 is tainted, so must be replaced
-/+ resource "aws_nat_gateway" "nat_1" {
      + association_id                     = (known after apply)
      ~ id                                 = "nat-053d8e2853385ce7d" -> (known after apply)
      ~ network_interface_id               = "eni-0e9caf1d3f4348745" -> (known after apply)
      ~ private_ip                         = "10.0.0.143" -> (known after apply)
      + public_ip                          = (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_2 is tainted, so must be replaced
-/+ resource "aws_nat_gateway" "nat_2" {
      + association_id                     = (known after apply)
      ~ id                                 = "nat-00e60b1f874d18eda" -> (known after apply)
      ~ network_interface_id               = "eni-0e670c6c64f919002" -> (known after apply)
      ~ private_ip                         = "10.0.128.203" -> (known after apply)
      + public_ip                          = (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_rds_cluster.wordpress will be created
  + resource "aws_rds_cluster" "wordpress" {
      + allocated_storage                     = (known after apply)
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + availability_zones                    = (known after apply)
      + backup_retention_period               = (known after apply)
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier                    = "wordpress"
      + cluster_identifier_prefix             = (known after apply)
      + cluster_members                       = (known after apply)
      + cluster_resource_id                   = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_name                         = "wordpress"
      + db_cluster_parameter_group_name       = (known after apply)
      + db_subnet_group_name                  = "wordpress"
      + db_system_id                          = (known after apply)
      + delete_automated_backups              = true
      + enable_global_write_forwarding        = false
      + enable_http_endpoint                  = false
      + enable_local_write_forwarding         = false
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_mode                           = "provisioned"
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_roles                             = (known after apply)
      + id                                    = (known after apply)
      + kms_key_id                            = (known after apply)
      + master_password                       = (sensitive value)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + master_username                       = "admin"
      + network_type                          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + reader_endpoint                       = (known after apply)
      + skip_final_snapshot                   = false
      + storage_encrypted                     = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + vpc_security_group_ids                = [
          + "sg-02f015e760b3cb2c6",
        ]
    }

  # aws_route_table.private_1 will be created
  + resource "aws_route_table" "private_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-07875707521c30620"
    }

  # aws_route_table.private_2 will be created
  + resource "aws_route_table" "private_2" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-07875707521c30620"
    }

  # aws_route_table_association.reverse_proxy_private_1 will be created
  + resource "aws_route_table_association" "reverse_proxy_private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0716901fe27fd7512"
    }

  # aws_route_table_association.reverse_proxy_private_2 will be created
  + resource "aws_route_table_association" "reverse_proxy_private_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-02dce6fccf468d75f"
    }

  # aws_route_table_association.wordpress_private_1 will be created
  + resource "aws_route_table_association" "wordpress_private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-039350281fbe8abf9"
    }

  # aws_route_table_association.wordpress_private_2 will be created
  + resource "aws_route_table_association" "wordpress_private_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0ed370ee4266b80e7"
    }

Plan: 24 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ravenoak, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*